In [1]:
import pandas as pd

# Country Name

In [7]:
df = pd.read_csv('CountryName.csv', encoding='utf-8')
df.shape
df.sample(3)

(608, 2)

              Ctry_Name Ctry_ISO3
299              Kuwait       KWT
117  Congo, Republic of       COG
271     Jhonston Island       JTN

In [8]:
# tmp = pd.DataFrame(
#     {
#         'Ctry_Name': ['Korea (South)', 'Virgin Islands (Brit)', 'Hongkong', 'Virgin Islands(Brit)', 'England', 'United States Virgin Islands', 'Moldovia', 'Falkland Islands (Malvinas)', 'Turks & Caicos Islands', 'Taiwan ROC'],
#         'Ctry_ISO3': ['KOR', 'VGB', 'HKG', 'VGB', 'GBR', 'VIR', 'MDA', 'FLK', 'TCA', 'TWN']
#     }
# )

# df = pd.concat([df, tmp], ignore_index=True)


# tmp = pd.DataFrame(
#     {
#         'Ctry_Name': ['DR Congo', 'Somaliland', 'Transnistria', 'Northern Cyprus', 'Akrotiri and Dhekelia'],
#         'Ctry_ISO3': ['COD', 'SOM', 'MDA', 'CYP', 'GBR-AD']
#     }
# )

# df = df.append({'Ctry_Name': "HongKong", 'Ctry_ISO3': 'HKG'}, ignore_index=True)
# df = df.append({'Ctry_Name': "montenegro", 'Ctry_ISO3': 'MNE'}, ignore_index=True)
# df = df.append({'Ctry_Name': "Canary Is", 'Ctry_ISO3': 'ESP'}, ignore_index=True)

# tmp = pd.DataFrame(
#     {
#         'Ctry_Name': ['HongKong', 'montenegro', 'Canary Is', 'Melilla', 'Ceuta', 'Tubai Is'],
#         'Ctry_ISO3': ['HKG', 'MNE', 'ESP', 'ESP', 'ESP', 'PYF']
#     }
# )

tmp = pd.DataFrame(
    {
        'Ctry_Name': ['TÃ¼rkiye'],
        'Ctry_ISO3': ['TUR'],
    }
)

iso2 = pd.read_csv('CountryISO2.csv', encoding='utf-8')
iso2.columns = ['Ctry_Name', 'Ctry_ISO3']

tmp2 = pd.DataFrame(
    {
        'Ctry_Name': df['Ctry_ISO3'].unique(),
        'Ctry_ISO3': df['Ctry_ISO3'].unique(),
    }
)

df = pd.concat([df, tmp, iso2, tmp2], ignore_index=True)

In [9]:
# df.loc[df['Ctry_Name'].str.contains('\?')]

In [10]:
df.drop_duplicates(inplace=True)
df.shape

(1182, 2)

In [11]:
df.duplicated(subset=['Ctry_Name']).sum()

0

In [12]:
df[df.duplicated(subset=['Ctry_Name'])]

Empty DataFrame
Columns: [Ctry_Name, Ctry_ISO3]
Index: []

In [13]:
df.sort_values(['Ctry_ISO3', 'Ctry_Name'], ascending=True, inplace=True)

In [14]:
df.to_csv('CountryName.csv', encoding='utf-8', index=False)

# Country ISO2

In [1]:
df = pd.read_csv('CountryISO2.csv', encoding='utf-8')
df.shape
df.sample(3)

(259, 2)

    Ctry_ISO2 Ctry_ISO3
107        IM       IMN
29         BO       BOL
148        MH       MHL

# US State Name

In [2]:
import us

state_abbrev = {state.name: state.abbr for state in us.states.STATES}
state_abbrev_filtered = {state: state_abbrev[state] for state in states if state in state_abbrev}
print(state_abbrev_filtered)

{'Alabama': 'AL', 'Alaska': 'AK', 'Arizona': 'AZ', 'Arkansas': 'AR', 'California': 'CA', 'Colorado': 'CO', 'Connecticut': 'CT', 'Delaware': 'DE', 'Florida': 'FL', 'Georgia': 'GA', 'Hawaii': 'HI', 'Idaho': 'ID', 'Illinois': 'IL', 'Indiana': 'IN', 'Iowa': 'IA', 'Kansas': 'KS', 'Kentucky': 'KY', 'Louisiana': 'LA', 'Maine': 'ME', 'Maryland': 'MD', 'Massachusetts': 'MA', 'Michigan': 'MI', 'Minnesota': 'MN', 'Mississippi': 'MS', 'Missouri': 'MO', 'Montana': 'MT', 'Nebraska': 'NE', 'Nevada': 'NV', 'New Hampshire': 'NH', 'New Jersey': 'NJ', 'New Mexico': 'NM', 'New York': 'NY', 'North Carolina': 'NC', 'North Dakota': 'ND', 'Ohio': 'OH', 'Oklahoma': 'OK', 'Oregon': 'OR', 'Pennsylvania': 'PA', 'Rhode Island': 'RI', 'South Carolina': 'SC', 'South Dakota': 'SD', 'Tennessee': 'TN', 'Texas': 'TX', 'Utah': 'UT', 'Vermont': 'VT', 'Virginia': 'VA', 'Washington': 'WA', 'West Virginia': 'WV', 'Wisconsin': 'WI', 'Wyoming': 'WY'}

In [4]:
df = pd.DataFrame(list(state_abbrev_filtered.items()), columns=['StateName', 'StateCode'])
df.shape
df.head(3)

(50, 2)

  StateName StateCode
0   Alabama        AL
1    Alaska        AK
2   Arizona        AZ

In [6]:
new = pd.DataFrame({
    'StateName': ['District of Columbia', 'Guam', 'Puerto Rico', 'Virgin Islands', 'American Samoa'],
    'StateCode': ['DC', 'GU', 'PR', 'VI', 'AS'],
})

In [7]:
df = pd.concat([df, new], ignore_index=True)
df.shape
df.drop_duplicates(inplace=True)
df.duplicated(subset=['StateName']).sum()

(55, 2)

0

In [8]:
df.to_csv('US_StateName.csv', encoding='utf-8', index=False)